Revit 2027 API
TransformWithBoundary Constructor
 Constructs a new copy of the input TransformWithBoundary object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TransformWithBoundary(
	TransformWithBoundary other
)
Public Sub New (
	other As TransformWithBoundary
)
public:
TransformWithBoundary(
	TransformWithBoundary^ other
)
new :
        other : TransformWithBoundary -> TransformWithBoundary
Parameters
other TransformWithBoundary
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TransformWithBoundary Class
Autodesk.Revit.DB Namespace